/* No comment provided by engineer. */
"<%@: %p> Regular expression = '%@', Compiled options = 0x%8.8x (%@)" = "<%1$@: %2$p> Regular expression = '%3$@', Compiled options = 0x%4$.8x (%5$@)";

/* No comment provided by engineer. */
"A 'next...' method must be invoked before information about the current match is available." = "A 'next...' method must be invoked before information about the current match is available.";

/* No comment provided by engineer. */
"captureIndex %lu >= captureCount %lu." = "captureIndex %1$lu >= captureCount %2$lu.";

/* No comment provided by engineer. */
"captureIndex > %lu captures in regular expression." = "captureIndex > %lu captures in regular expression.";

/* No comment provided by engineer. */
"captureNameString == nil." = "captureNameString == nil.";

/* No comment provided by engineer. */
"firstReference == nil." = "firstReference == nil.";

/* No comment provided by engineer. */
"length %lu < end location %lu for range %@." = "length %1$lu < end location %2$lu for range %3$@.";

/* No comment provided by engineer. */
"length %lu < start location %lu for range %@." = "length %1$lu < start location %2$lu for range %3$@.";

/* No comment provided by engineer. */
"matchedRanges == NULL." = "matchedRanges == NULL.";

/* No comment provided by engineer. */
"pcre_fullinfo for PCRE_INFO_JCHANGED failed." = "pcre_fullinfo for PCRE_INFO_JCHANGED failed.";

/* No comment provided by engineer. */
"rangeCount < minimum required: %d" = "rangeCount < minimum required: %d";

/* No comment provided by engineer. */
"ranges == NULL" = "ranges == NULL";

/* No comment provided by engineer. */
"referenceFormatString == nil." = "referenceFormatString == nil.";

/* No comment provided by engineer. */
"referenceString == nil." = "referenceString == nil.";

/* No comment provided by engineer. */
"Requested capture %lu > %lu captures in regular expression." = "Requested capture %1$lu > %2$lu captures in regular expression.";

/* No comment provided by engineer. */
"RKCaptureIndexForCaptureNameCharacters: aRegex == NULL." = "RKCaptureIndexForCaptureNameCharacters: aRegex == NULL.";

/* No comment provided by engineer. */
"RKCompileErrorCode = %@ (#%d)\n%@\n%@\nRegular expression: '%@'." = "RKCompileErrorCode = %1$@ (#%2$d)\n%3$@\n%4$@\nRegular expression: '%5$@'.";

/* No comment provided by engineer. */
"RKRegex Regular Expression Cache" = "RKRegex Regular Expression Cache";

/* No comment provided by engineer. */
"The argument for regexString is nil." = "The argument for regexString is nil.";

/* No comment provided by engineer. */
"The argument for string: is nil." = "The argument for string: is nil.";

/* No comment provided by engineer. */
"The captureName '%*.*s' does not exist." = "The captureName '%*.*s' does not exist.";

/* No comment provided by engineer. */
"The captureName '%@' does not exist." = "The captureName '%@' does not exist.";

/* No comment provided by engineer. */
"The error occured at the character '%c' in '%@'." = "The error occured at the character '%1$c' in '%2$@'.";

/* No comment provided by engineer. */
"The specified regular expression is nil." = "The specified regular expression is nil.";

/* No comment provided by engineer. */
"Unable to allocate additional memory." = "Unable to allocate additional memory.";

/* No comment provided by engineer. */
"Unable to allocate temporary stack space." = "Unable to allocate temporary stack space.";

/* No comment provided by engineer. */
"Unable to convert the class '%@' to a regular expression." = "Unable to convert the class '%@' to a regular expression.";

/* No comment provided by engineer. */
"Unable to create a pthread key for per thread resources.  Some functionality may not be available.  pthread_key_create returned %d, '%s'." = "Unable to create a pthread key for per thread resources.  Some functionality may not be available.  pthread_key_create returned %1$d, '%2$s'.";

/* No comment provided by engineer. */
"Unable to create object." = "Unable to create object.";

/* No comment provided by engineer. */
"Unable to determine the major and minor version of the pcre library." = "Unable to determine the major and minor version of the pcre library.";

/* No comment provided by engineer. */
"Unable to get string buffer from object '%@', which is a copy of the passed object '%@'." = "Unable to get string buffer from object '%1$@', which is a copy of the passed object '%2$@'.";

/* No comment provided by engineer. */
"UNKNOWN" = "UNKNOWN";

/* No comment provided by engineer. */
"Unknown regular expression engine." = "Unknown regular expression engine.";

